module CountriesHelper
  def country_options
    [
      [ "日本", "JP" ],

      # 東アジア
      [ "韓国", "KR" ],
      [ "台湾", "TW" ],
      [ "中国", "CN" ],
      [ "香港", "HK" ],
      [ "マカオ", "MO" ],

      # 東南アジア
      [ "タイ", "TH" ],
      [ "ベトナム", "VN" ],
      [ "シンガポール", "SG" ],
      [ "マレーシア", "MY" ],
      [ "インドネシア", "ID" ],
      [ "フィリピン", "PH" ],

      # 南アジア
      [ "インド", "IN" ],
      [ "スリランカ", "LK" ],

      # オセアニア
      [ "オーストラリア", "AU" ],
      [ "ニュージーランド", "NZ" ],

      # 北米
      [ "アメリカ", "US" ],
      [ "カナダ", "CA" ],

      # 中南米
      [ "メキシコ", "MX" ],
      [ "ブラジル", "BR" ],

      # ヨーロッパ
      [ "イギリス", "GB" ],
      [ "フランス", "FR" ],
      [ "ドイツ", "DE" ],
      [ "イタリア", "IT" ],
      [ "スペイン", "ES" ],
      [ "ポルトガル", "PT" ],
      [ "オランダ", "NL" ],
      [ "ベルギー", "BE" ],
      [ "スイス", "CH" ],
      [ "オーストリア", "AT" ],
      [ "チェコ", "CZ" ],
      [ "ハンガリー", "HU" ],
      [ "ポーランド", "PL" ],
      [ "スウェーデン", "SE" ],
      [ "ノルウェー", "NO" ],
      [ "デンマーク", "DK" ],
      [ "フィンランド", "FI" ],

      # 中東
      [ "トルコ", "TR" ],
      [ "アラブ首長国連邦", "AE" ],
      [ "イスラエル", "IL" ],

      # アフリカ
      [ "エジプト", "EG" ],
      [ "モロッコ", "MA" ],
      [ "南アフリカ", "ZA" ],

      # その他
      [ "その他", "OTHER" ]
    ]
  end
end
